eisup_2019_docmng_integration/src/InformationRegisters/абс_ПроектыРезервовРНПДПоЗЗ/абс_ПроектыРезервовРНПДПоЗЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ПроектыРезервовРНПДПоЗЗ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРНП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗакупочныйЗаказ</name>
    <type>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ПериодВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ПроектыРезервовРНПДПоЗЗ/ManagerModule.bsl
//Сторчевой А.Н. НФС 2018 {
Процедура ВыполнитьЗаписьПоРезультатуЗапроса(РезультатЗапроса, ДоговорКонтрагента) Экспорт 
//ххх Брель Виктор Андреевич 25.03.2018 15:05:16, заявка <<<

Если НЕ РезультатЗапроса.Пустой() Тогда
	Выборка		= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.абс_ПроектыРезервовРНПДПоЗЗ.СоздатьМенеджерЗаписи();	
		
		Если Выборка.Остаток > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Период								= Выборка.Период;
			Запись.ДоговорКонтрагента					= ДоговорКонтрагента;
			Запись.СуммаРНП	   = Выборка.Остаток;
			Запись.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Запись.СуммаРНП,
	                                                   Истина, Ложь,
	                                                   УчетНДС.ПолучитьСтавкуНДС(Выборка.СтавкаНДС));
			Запись.ttk_ПериодВозникновенияЗадолженности = Выборка.Период;			
		КонецЕсли;
		Если Запись	<> Неопределено Тогда
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
КонецЕсли;

// Брель Виктор Андреевич 25.03.2018 15:05:16 >>>
	
	
КонецПроцедуры
//} Сторчевой А.Н. НФС 2018
